app/Controllers/Petugas.php

SELECT *
FROM `pengaduan`
JOIN `masyarakat` ON `masyarakat`.`nik`=`pengaduan`.`nik`
---
	public function verifikasi(){
		if(!session()->get('sudahkahLogin')){
			return redirect()->to('/petugas');
			exit;
			}
			$this->pengaduan->join('masyarakat','masyarakat.nik=pengaduan.nik');

INSERT INTO `tanggapan` (`id_petugas`, `id_pengaduan`, `tanggapan`, `tgl_tanggapan`) VALUES ('2', '9', 'baik terima kasih kami akan segera tindak lanjuti', '2023-03-19')
---
	public function simpantanggapan(){
		if(!session()->get('sudahkahLogin')){
			return redirect()->to('/petugas');
			exit;
			}
			if($this->request->getPost('txtId')){
				$data=['status'=>$this->request->getPost('selectStatus')];
			} else {
				$data=['status'=>$this->request->getPost('selectStatus')];
			}
			$this-> pengaduan-> update($this->request->getPost('txtId'),$data);

			if($this->request->getPost('tanggapan')){
			helper(['form']);
			$datanya=[
				'id_petugas' =>session()->get('id_petugas'),
				'id_pengaduan'=>$this->request->getPost('txtId'),
				'tanggapan'=>$this->request->getPost('tanggapan'),
				'tgl_tanggapan'=>$this->request->getPost('tanggal')];
				$this->tanggapan->insert($datanya);

SELECT *
FROM `tanggapan`
JOIN `pengaduan` ON `pengaduan`.`id_pengaduan`=`tanggapan`.`id_pengaduan`
JOIN `masyarakat` ON `masyarakat`.`nik`=`pengaduan`.`nik`
JOIN `petugas` ON `petugas`.`id_petugas`=`tanggapan`.`id_petugas`
---
	public function respon(){
		if(!session()->get('sudahkahLogin')){
			return redirect()->to('/petugas');
			exit;
			}
			$this->tanggapan->join('pengaduan','pengaduan.id_pengaduan=tanggapan.id_pengaduan');
			$this->tanggapan->join('masyarakat','masyarakat.nik=pengaduan.nik');
			$this->tanggapan->join('petugas','petugas.id_petugas=tanggapan.id_petugas');